Repository: gasvn/ssh2fa
Catalog: auto2fa-mac/Auto2FA/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: "%@" is no longer a Host in ~/.ssh/config — it won't connect. Add it back to your config, or remove it from SSH2FA (⋯ → Remove Host…).
zh_hans: “%@”已不在 ~/.ssh/config 中 —— 无法连接。请加回配置文件，或从 SSH2FA 移除（⋯ → 移除主机…）。

source: %@ is available
zh_hans: %@ 可用

source: %@ — click ⋯ → Open in Finder
zh_hans: %@ —— 点 ⋯ → 在访达中打开

source: %@ — macOS won't ask again for this version.
zh_hans: %@ —— 这个版本 macOS 不会再询问了。

source: %@, and merged into a single Keychain item — future updates will ask once instead of once per host.
zh_hans: %@,并已合并为单个钥匙串条目 —— 以后更新只会询问一次,而不是每台主机各问一次。

# %lld failed connection attempt%@
source: %1$lld failed connection attempt%2$@
zh_hans: %lld 次连接失败%@

source: %1$lld of %2$lld authorized. Not authorized: %3$@. Open each one's Password & Setup and choose “Always Allow”.
zh_hans: 已授权 %1$lld / %2$lld 项。未授权:%3$@。请分别打开它们的"密码与设置"并选择「始终允许」。

source: %lld selected
zh_hans: 已选择 %lld 项

source: (no node)
zh_hans: （无节点）

source: (not a valid secret)
zh_hans: （不是有效的密钥）

source: 2FA code unavailable — tap to retry
zh_hans: 无法获取 2FA 验证码 —— 点按重试

# :%lld (local) → :%lld (remote)
source: :%1$lld (local) → :%2$lld (remote)
zh_hans: :%lld（本地）→ :%lld（远程）

# :%lld → %@:%lld (direct)
source: :%1$lld → %2$@:%3$lld (direct)
zh_hans: :%lld → %@:%lld（直连）

source: About
zh_hans: 关于

source: Actions
zh_hans: 操作

source: Add 2FA secret
zh_hans: 添加双因素密钥

source: Add Host
zh_hans: 添加主机

source: Add SSH host
zh_hans: 添加 SSH 主机

source: Add a folder you work in — mounting it takes you straight there.
zh_hans: 添加你常用的文件夹——挂载后可直接进入。

source: Add a host manually
zh_hans: 手动添加主机

source: Add a tunnel
zh_hans: 添加隧道

source: Add from ~/.ssh/config
zh_hans: 从 ~/.ssh/config 添加

source: Advanced
zh_hans: 高级

source: After Mac sleeps, the underlying TCP for every SSH master dies. Recommended on — without it tunnels silently break with no automatic recovery.
zh_hans: Mac 睡眠后，每个 SSH 主连接底层的 TCP 都会断开。建议开启 —— 否则隧道会无声中断且不会自动恢复。

source: All %lld hosts authorized
zh_hans: %lld 台主机已全部授权

source: All 1 host authorized
zh_hans: 1 台主机已授权

source: Always-on notch status (experimental)
zh_hans: 常驻灵动岛状态（实验性）

source: Appended after `http://localhost:%lld` when you click 🧭 or auto-open fires. Use this for jupyter `?token=…`, tensorboard `/#scalars`, etc.
zh_hans: 点击 🧭 或自动打开时，会附加在 `http://localhost:%lld` 之后。适合 jupyter 的 `?token=…`、tensorboard 的 `/#scalars` 等。

source: Applies the next time this tunnel starts.
zh_hans: 将在此隧道下次启动时生效。

source: Ask the daemon for the next unused local port
zh_hans: 向后台助手请求下一个未占用的本地端口

source: Ask the first time
zh_hans: 首次使用时询问

source: Asks for Touch ID (or your Mac password) first
zh_hans: 会先要求 Touch ID（或你的 Mac 密码）

source: Asks for Touch ID (or your Mac password) first. Use it to set up the same account in another authenticator.
zh_hans: 会先要求 Touch ID（或你的 Mac 密码）。可用它在另一个验证器 App 中设置同一账户。

source: Authenticating…
zh_hans: 正在验证…

source: Authentication was cancelled or failed. Try again, or quit.
zh_hans: 验证已取消或失败。请重试，或退出。

source: Authorize now
zh_hans: 立即授权

source: Authorize saved credentials after this update
zh_hans: 更新后请授权已保存的凭据

# Authorizing %@ (%lld of %lld)…
source: Authorizing %1$@ (%2$lld of %3$lld)…
zh_hans: 正在授权 %1$@(第 %2$lld / %3$lld 个)…

source: Auto
zh_hans: 自动

source: Auto (any ready host)
zh_hans: 自动（任一就绪主机）

source: Auto — any ready host. Click to pin.
zh_hans: 自动 —— 任一就绪主机。点击可固定。

source: Auto-mount %@ on connect
zh_hans: 连接后自动挂载 %@

source: Auto-scroll
zh_hans: 自动滚动

source: Automatically check for updates
zh_hans: 自动检查更新

source: Back
zh_hans: 返回

source: SSH2FA isn't ready — quit and reopen the app. Use Troubleshoot if the problem continues.
zh_hans: SSH2FA 尚未就绪 —— 请退出并重新打开应用。如果问题仍然存在，请使用“故障排查”。

source: Browse the host's folders instead of typing a path
zh_hans: 浏览主机上的文件夹，不用手打路径

source: Browser URL suffix
zh_hans: 浏览器网址后缀

source: Browse…
zh_hans: 浏览…

source: Built for HPC / cluster logins. You'll need your 2FA **secret key** (the TOTP setup key) — SSH2FA types the codes. It does **not** work with Duo Push / approve-on-phone.
zh_hans: 专为 HPC / 集群登录设计。你需要 2FA 的**密钥**（TOTP 设置密钥）—— 验证码由 SSH2FA 输入。它**不支持** Duo Push / 手机点确认。

source: Can't reach the server — check Wi-Fi or VPN.
zh_hans: 无法连接到服务器 —— 请检查 Wi-Fi 或 VPN。

source: Cancel
zh_hans: 取消

source: Change password
zh_hans: 更改密码

source: Changing a port reconnects this tunnel on the new port.
zh_hans: 更改端口会让此隧道在新端口上重新连接。

source: Check for Updates
zh_hans: 检查更新

source: Checking the download…
zh_hans: 正在校验下载内容…

source: Checking what's stored…
zh_hans: 正在检查已保存的内容…

source: Checking…
zh_hans: 正在检查…

source: Checks GitHub about once a day for a newer release and flags it in the menu bar. Installing stays your call: one click in the About tab downloads it, verifies it, and restarts into the new version.
zh_hans: 大约每天检查一次 GitHub 上是否有新版本，并在菜单栏标记。是否安装仍由你决定：在"关于"标签页点一下，就会自动下载、校验，并重启进入新版本。

source: Checks GitHub about once a day for a newer release and flags it in the menu bar. Never downloads or installs anything on its own — the About tab shows one-step update instructions.
zh_hans: 大约每天检查一次 GitHub 上的新版本，并在菜单栏标记。绝不会自行下载或安装 —— “关于”标签页会给出一步到位的更新说明。

source: Choose “Always Allow” on each prompt
zh_hans: 每个弹窗都请选择“始终允许”

source: Clear
zh_hans: 清除

source: Clear all tags
zh_hans: 清除所有标签

source: Clone…
zh_hans: 克隆…

source: Close
zh_hans: 关闭

source: Command Palette…
zh_hans: 命令面板…

source: Compact row mode
zh_hans: 紧凑行模式

source: Compute allocation time left
zh_hans: 计算资源剩余时间

source: Compute node ended — pick a new one
zh_hans: 计算节点已结束 —— 请另选一个

source: Confirming macOS remembered the permission…
zh_hans: 正在确认 macOS 是否记住了授权…

source: Connect
zh_hans: 连接

source: Connect automatically on startup
zh_hans: 启动时自动连接

source: Connect host
zh_hans: 连接主机

source: Connect the host first to browse its folders
zh_hans: 请先连接主机才能浏览其文件夹

source: Connected
zh_hans: 已连接

source: Connected, finishing setup…
zh_hans: 已连接，正在完成设置…

source: Connecting (preparing)…
zh_hans: 正在连接（准备中）…

source: Starting SSH2FA…
zh_hans: 正在启动 SSH2FA…

source: Connecting…
zh_hans: 正在连接…

source: Connection
zh_hans: 连接

source: Connection dropped — server restarted or network changed.
zh_hans: 连接已断开 —— 服务器重启或网络发生变化。

source: Connection problem: %@
zh_hans: 连接问题：%@

source: Consolidating into a single Keychain item…
zh_hans: 正在合并为单个钥匙串条目…

source: Copied ✓
zh_hans: 已拷贝 ✓

source: Copy
zh_hans: 拷贝

source: Copy URL
zh_hans: 拷贝 URL

source: Copy command
zh_hans: 拷贝命令

source: Copy diagnostics
zh_hans: 拷贝诊断信息

source: Copy localhost:%lld
zh_hans: 拷贝 localhost:%lld

source: Couldn't open the downloaded disk image.
zh_hans: 无法打开下载的磁盘映像。

source: Couldn't start the installer step: %@
zh_hans: 无法启动安装步骤：%@

source: Couldn't write the new version next to the current one: %@
zh_hans: 无法把新版本写入当前版本旁边：%@

source: Crashed
zh_hans: 已崩溃

source: Create
zh_hans: 创建

source: Current code
zh_hans: 当前验证码

source: Currently: %@
zh_hans: 当前：%@

source: Custom node for '%@'
zh_hans: “%@”的自定义节点

source: Custom node…
zh_hans: 自定义节点…

source: Defined by you in ~/.ssh/config, so SSH2FA doesn't change it. Edit that file to change where “%@” points.
zh_hans: 这是你自己在 ~/.ssh/config 中定义的，SSH2FA 不会改动它。要更改“%@”指向的位置，请编辑该文件。

source: Delete
zh_hans: 删除

source: Delete tunnel
zh_hans: 删除隧道

source: Deleted '%@'
zh_hans: 已删除“%@”

source: Details…
zh_hans: 详情…

source: Disabled
zh_hans: 已禁用

source: Disconnect
zh_hans: 断开连接

source: Disconnect host
zh_hans: 断开主机

source: Dismiss
zh_hans: 忽略

source: Dismiss the getting-started checklist
zh_hans: 忽略入门清单

source: Dismiss this message
zh_hans: 忽略此消息

source: Do Not Disturb (compact notch)
zh_hans: 勿扰模式（紧凑灵动岛）

source: Done
zh_hans: 完成

source: Download DMG
zh_hans: 下载 DMG

source: Download the DMG
zh_hans: 下载 DMG

# Downloading — %@ of %@
source: Downloading — %1$@ of %2$@
zh_hans: 正在下载 — %@ / %@

source: Downloading…
zh_hans: 正在下载…

source: Downloads and installs the new version, then restarts SSH2FA.
zh_hans: 下载并安装新版本，然后重新启动 SSH2FA。

source: Downloads it, checks it, installs it, and restarts SSH2FA. Your hosts stay connected — no new 2FA login.
zh_hans: 自动下载、校验、安装，然后重启 SSH2FA。已连接的主机保持连接，无需重新做两步验证。

source: Dynamic Notch toasts
zh_hans: 灵动岛提示

source: Enable 2FA
zh_hans: 启用 2FA

source: Every host in your ~/.ssh/config is already 2FA-enabled, or your config has no Host entries.
zh_hans: 你 ~/.ssh/config 里的主机都已启用 2FA，或者配置中没有 Host 条目。

source: Export Tunnels…
zh_hans: 导出隧道…

source: Failed — see activity log
zh_hans: 失败 —— 请查看活动日志

source: Filter by job, partition, name, node…
zh_hans: 按作业、分区、名称、节点筛选…

source: Fix…
zh_hans: 修复…

source: For best reliability, drag SSH2FA.app to /Applications first — SMAppService remembers the bundle path at register time, so moving the .app later silently breaks the auto-launch.
zh_hans: 为获得最佳可靠性，请先把 SSH2FA.app 拖到 /Applications —— SMAppService 会记住注册时的路径，之后移动 .app 会让自动启动静默失效。

source: Force-unmount everything (if stuck)
zh_hans: 强制卸载全部（卡住时使用）

source: Found %lld host(s) in your ~/.ssh/config
zh_hans: 在 ~/.ssh/config 中找到 %lld 个主机

source: Found %lld host(s) in ~/.ssh/config — pick which to protect
zh_hans: 在 ~/.ssh/config 中找到 %lld 个主机 —— 选择要保护的

source: General
zh_hans: 通用

source: Get started
zh_hans: 开始使用

source: Getting the download…
zh_hans: 正在获取下载地址…

source: GitHub returned HTTP %lld when looking for the download.
zh_hans: 查找下载文件时 GitHub 返回 HTTP %lld。

source: Go up one folder
zh_hans: 返回上一级文件夹

source: Goal: **$99 / year — the Apple Developer fee.**
zh_hans: 目标：**每年 99 美元 —— Apple 开发者会员费。**

source: Has a post-connect command
zh_hans: 有连接后命令

source: Health checks
zh_hans: 健康检查

source: Help get SSH2FA notarized
zh_hans: 帮助 SSH2FA 完成公证

source: Hide
zh_hans: 隐藏

source: Hide the password you typed
zh_hans: 隐藏你输入的密码

source: Hide the revealed password
zh_hans: 隐藏已显示的密码

source: Host
zh_hans: 主机

source: Host actions
zh_hans: 主机操作

source: Host:
zh_hans: 主机：

source: Hostname or SSH alias
zh_hans: 主机名或 SSH 别名

source: Hosts
zh_hans: 主机

source: How SSH2FA works
zh_hans: SSH2FA 的工作方式

source: How do I get this?
zh_hans: 我要去哪里找？

source: Idle
zh_hans: 空闲

source: If your clipboard has `ssh -L 8888:host:8888 user@node` or a localhost URL, prefill from it
zh_hans: 如果剪贴板里有 `ssh -L 8888:host:8888 user@node` 或 localhost 链接，就用它预填

source: Import Tunnels…
zh_hans: 导入隧道…

source: Import hosts from your SSH config file
zh_hans: 从你的 SSH 配置文件导入主机

source: In Do Not Disturb, toasts don't drop a panel down — they just expand compactly around the notch (icon + a few words). Less intrusive while you work.
zh_hans: 勿扰模式下，提示不会下拉出面板 —— 只在灵动岛周围紧凑展开（图标 + 几个字）。工作时干扰更小。

source: Initializing
zh_hans: 正在初始化

source: Installing…
zh_hans: 正在安装…

source: It answers the password + 2FA prompt for you and keeps a warm connection to each host, so ssh, scp, and your editor connect instantly with no code to type. Your password and 2FA secret are stored in the macOS Keychain.
zh_hans: 它替你应答密码 + 2FA 提示，并为每台主机维持一个热连接，所以 ssh、scp 和你的编辑器都能立刻连上，不用输任何验证码。你的密码和 2FA 密钥保存在 macOS 钥匙串中。

source: It's registered with SSH2FA, but ssh has no entry for this name — so it can't connect. Add a `Host %@` block to ~/.ssh/config, or re-add it with “Add Host” so SSH2FA manages the entry.
zh_hans: 它已在 SSH2FA 注册，但 ssh 没有这个名字的条目 —— 所以无法连接。请在 ~/.ssh/config 添加 `Host %@` 段，或用“添加主机”重新添加，由 SSH2FA 管理该条目。

source: Its saved password and 2FA secret are deleted from your Keychain, and its connection is closed. Your ~/.ssh/config is not changed. This can't be undone.
zh_hans: 它保存的密码和 2FA 密钥会从你的钥匙串中删除，连接也会关闭。你的 ~/.ssh/config 不会被修改。此操作无法撤销。

source: JobID
zh_hans: 作业 ID

source: Ko-fi · instant, 0% platform fee · one-time or monthly
zh_hans: Ko-fi · 即时到账、0% 平台抽成 · 可单次或按月

source: Later
zh_hans: 稍后

source: Launch
zh_hans: 启动

source: Load more history (keeps showing it — the live tail won't shrink it back)
zh_hans: 加载更多历史（会保持显示 —— 实时日志不会把它收回去）

source: Loading 2FA code…
zh_hans: 正在加载 2FA 验证码…

source: Loading jobs from squeue…
zh_hans: 正在从 squeue 加载作业…

source: Loading log…
zh_hans: 正在加载日志…

source: Local
zh_hans: 本地

source: Local port
zh_hans: 本地端口

source: Locks the dashboard and log windows behind Touch ID (falls back to your Mac login password). The menu-bar icon stays visible. Re-locks ~60s after you close the window.
zh_hans: 用 Touch ID 锁定面板和日志窗口（可回退到 Mac 登录密码）。菜单栏图标仍然可见。关闭窗口约 60 秒后重新锁定。

source: Log into your 2FA-protected SSH hosts once, then stay connected — SSH2FA types your TOTP code for you every time you ssh.
zh_hans: 登录一次受 2FA 保护的 SSH 主机，然后保持连接 —— 每次 ssh 时 SSH2FA 都替你输入 TOTP 验证码。

source: Login failed
zh_hans: 登录失败

source: Login rejected — update the password or 2FA secret in Password & setup, then run Test login.
zh_hans: 登录被拒绝。请在“密码与设置”中更新密码或两步验证密钥，然后运行“测试登录”。

source: Logs
zh_hans: 日志

source: Made by Shanghua Gao ·
zh_hans: 作者：Shanghua Gao ·

source: Master connected
zh_hans: 主连接已建立

source: Master not connected
zh_hans: 主连接未建立

source: Mount
zh_hans: 挂载

source: Mount filesystem
zh_hans: 挂载文件系统

source: Mount this folder automatically as soon as the host connects
zh_hans: 主机连上后立即自动挂载此文件夹

source: Name
zh_hans: 名称

source: Name for this folder
zh_hans: 此文件夹的名称

source: Needs a TOTP secret key — not Duo Push. Re-enrol the account in your 2FA provider's device page to get a fresh key.
zh_hans: 需要 TOTP 密钥 —— 不是 Duo Push。请在你的 2FA 服务商设备页面重新注册该账户以获取新密钥。

source: New Tunnel
zh_hans: 新建隧道

source: New Tunnel…
zh_hans: 新建隧道…

source: New tunnel (⌘N)
zh_hans: 新建隧道 (⌘N)

source: Next
zh_hans: 下一步

source: Next free
zh_hans: 下一个空闲端口

source: No events yet.
zh_hans: 暂无事件。

source: No hosts match “%@”
zh_hans: 没有匹配“%@”的主机

source: No jobs match “%@”.
zh_hans: 没有匹配“%@”的作业。

source: No lines match “%@”.
zh_hans: 没有匹配“%@”的行。

source: No log output yet.
zh_hans: 暂无日志输出。

source: No matches.
zh_hans: 无匹配项。

source: No password stored for this host
zh_hans: 此主机未保存密码

source: No pinned folders yet — “Mount” will mount the whole filesystem (/).
zh_hans: 尚未固定任何文件夹——“挂载”将挂载整个文件系统 (/)。

source: No registered hosts yet — add a host first, then forward a port to it.
zh_hans: 还没有已注册的主机 —— 请先添加主机，再向它转发端口。

source: No running jobs found. Use a custom node, or start a SLURM job first.
zh_hans: 没有找到运行中的作业。请使用自定义节点，或先启动一个 SLURM 作业。

source: No saved credentials to authorize.
zh_hans: 没有需要授权的已存凭据。

source: No sub-folders here — “Pin this folder” to pin it as-is.
zh_hans: 这里没有子文件夹 —— 点“固定此文件夹”直接固定当前目录。

source: No tags yet — add one from CLI or tunnels.json.
zh_hans: 还没有标签 —— 可从命令行或 tunnels.json 添加。

source: No tunnels match “%@”
zh_hans: 没有匹配“%@”的隧道

source: No tunnels with the selected tag.
zh_hans: 所选标签下没有隧道。

source: Node
zh_hans: 节点

source: Not connected
zh_hans: 未连接

source: Not found as a Host in ~/.ssh/config — make sure it's a real ssh alias or a reachable hostname.
zh_hans: 在 ~/.ssh/config 中找不到该 Host —— 请确认它是真实的 ssh 别名或可达的主机名。

source: Off — the app's "Open Terminal" already reuses the connection. Turning this on also makes ssh <host> in your own Terminal skip the 2FA prompt.
zh_hans: 关闭 —— App 的“打开终端”本身已经复用连接。开启后，你在自己终端里运行 ssh <主机> 也能跳过 2FA 验证。

source: On a SLURM cluster? You can also forward a local port to a compute node — see the Tunnels tab.
zh_hans: 在用 SLURM 集群？你还可以把本地端口转发到计算节点 —— 见“隧道”标签页。

source: On first connect, macOS asks permission for SSH2FA to use its own saved credentials in your Keychain — click “Always Allow”.
zh_hans: 首次连接时，macOS 会询问是否允许 SSH2FA 使用它自己保存在钥匙串中的凭据 —— 请点“始终允许”。

source: On — running ssh <host> in your own Terminal reuses SSH2FA's warm connection (via one Include line added to ~/.ssh/config).
zh_hans: 开启 —— 在你自己的终端里运行 ssh <主机> 会复用 SSH2FA 的热连接（通过向 ~/.ssh/config 添加一行 Include 实现）。

source: Only TOTP codes (the kind you type) are supported — not Duo Push (approve-on-phone). Your secret is stored in the macOS Keychain.
zh_hans: 仅支持 TOTP 验证码（需要你输入的那种）—— 不支持 Duo Push（手机点确认）。你的密钥保存在 macOS 钥匙串中。

source: Open
zh_hans: 打开

source: Open SSH in
zh_hans: 用以下终端打开 SSH

source: Open Terminal
zh_hans: 打开终端

source: Open in Finder
zh_hans: 在访达中打开

source: Open in Finder after mounting
zh_hans: 挂载后在访达中打开

source: Open in browser
zh_hans: 在浏览器中打开

source: Open localhost URL in browser when tunnel comes up
zh_hans: 隧道启动后在浏览器中打开 localhost 链接

source: Overview
zh_hans: 概览

source: Partition
zh_hans: 分区

source: Password
zh_hans: 密码

source: Password & Setup…
zh_hans: 密码与设置…

source: Password and OTP secret are stored in your macOS Keychain. Never written to disk in plaintext.
zh_hans: 密码和 OTP 密钥保存在 macOS 钥匙串中，绝不会以明文写入磁盘。

source: Password:
zh_hans: 密码：

source: Paste SSH command
zh_hans: 粘贴 SSH 命令

source: Pick a compute node for '%@'
zh_hans: 为“%@”选择计算节点

source: Pick a compute node to start
zh_hans: 选择一个计算节点以启动

source: Pick hosts to protect →
zh_hans: 选择要保护的主机 →

source: Pick node
zh_hans: 选择节点

source: Pick node & start…
zh_hans: 选择节点并启动…

source: Pick node…
zh_hans: 选择节点…

source: Pick which to protect — we pre-fill the alias, you just enter the password and 2FA secret (or scan the QR). We test-login before saving so a wrong code can't lock you out.
zh_hans: 选择要保护的主机 —— 别名会自动填好，你只需输入密码和 2FA 密钥（或扫描二维码）。保存前我们会先试登录，避免错误的密钥把你锁在外面。

source: Pin
zh_hans: 固定

source: Pin this folder
zh_hans: 固定此文件夹

source: Pinned Folders…
zh_hans: 已固定的文件夹…

source: Pinned folders
zh_hans: 已固定的文件夹

source: Pinned to %@. Click to change.
zh_hans: 已固定到 %@。点击可更改。

source: Port
zh_hans: 端口

source: Port %lld already in use
zh_hans: 端口 %lld 已被占用

source: Port forwarding (optional)
zh_hans: 端口转发（可选）

source: Ports
zh_hans: 端口

source: Press Return (or the “Test login” button below) to verify before saving.
zh_hans: 按回车（或下方的“测试登录”）先验证再保存。

source: Preview:
zh_hans: 预览：

source: Privacy & Security
zh_hans: 隐私与安全

source: Quit SSH2FA
zh_hans: 退出 SSH2FA

source: Re-run checks
zh_hans: 重新检查

source: Recent activity
zh_hans: 最近活动

source: Recent:
zh_hans: 最近：

source: Reconnect
zh_hans: 重新连接

source: Reconnect now
zh_hans: 立即重新连接

source: Restoring SSH connections…
zh_hans: 正在恢复 SSH 连接…

source: Refresh
zh_hans: 刷新

source: Release notes
zh_hans: 发行说明

source: Reload
zh_hans: 重新加载

source: Remote
zh_hans: 远程

source: Remote filesystem mounted — click ⋯ → Open in Finder
zh_hans: 远程文件系统已挂载 —— 点 ⋯ → 在访达中打开

source: Remote folder path
zh_hans: 远程文件夹路径

source: Remote port
zh_hans: 远程端口

source: Remove Host
zh_hans: 移除主机

source: Remove Host…
zh_hans: 移除主机…

source: Removes SSH2FA's background service and Keychain credentials.
zh_hans: 移除 SSH2FA 的后台服务和钥匙串凭据。

source: Rename
zh_hans: 重命名

source: Rename tunnel
zh_hans: 重命名隧道

source: Rename…
zh_hans: 重命名…

source: Replace 2FA secret
zh_hans: 替换双因素密钥

source: Replace it below — logins will keep failing until you do.
zh_hans: 请在下方替换 —— 在此之前登录会持续失败。

source: Require Touch ID to open the dashboard
zh_hans: 打开面板需要 Touch ID

source: Restart SSH2FA service
zh_hans: 重启 SSH2FA 服务

source: Restarting SSH2FA…
zh_hans: 正在重新启动 SSH2FA…

source: Retry
zh_hans: 重试

source: Retry after applying the suggested fix
zh_hans: 按建议修复后重试

source: Retry connecting
zh_hans: 重试连接

source: Reveal
zh_hans: 显示

source: Reveal log file…
zh_hans: 在访达中显示日志文件…

source: Reveal setup URL
zh_hans: 显示设置链接

source: Reveal the stored password
zh_hans: 显示已保存的密码

source: Run on connect
zh_hans: 连接后运行

source: Runs each time this tunnel transitions to alive. Env: AUTO2FA_TUNNEL_NAME, AUTO2FA_LOCAL_PORT, AUTO2FA_NODE, AUTO2FA_JUMP, AUTO2FA_URL.
zh_hans: 每次此隧道变为存活时运行。环境变量：AUTO2FA_TUNNEL_NAME、AUTO2FA_LOCAL_PORT、AUTO2FA_NODE、AUTO2FA_JUMP、AUTO2FA_URL。

source: SSH ControlMaster pool + 2FA login + SLURM-aware port forwarding
zh_hans: SSH ControlMaster 连接池 + 2FA 登录 + 感知 SLURM 的端口转发

source: SSH password
zh_hans: SSH 密码

source: SSH2FA Logs
zh_hans: SSH2FA 日志

source: SSH2FA doesn't have permission to update itself in %@ — it may have been installed by another user.
zh_hans: SSH2FA 没有权限在 %@ 中更新自己 —— 它可能是由另一个用户安装的。

source: SSH2FA is free & open source. The one missing piece is an Apple Developer membership ($99/yr). With it the app can be notarized — it installs with zero Gatekeeper warnings for everyone, plus signed updates and a Homebrew cask that just works. If SSH2FA saves you the daily 2FA dance, chip in toward the $99.
zh_hans: SSH2FA 是免费开源的。唯一缺的是 Apple 开发者会员（每年 99 美元）。有了它 App 就能完成公证 —— 所有人安装时都不会有 Gatekeeper 警告，还能有签名更新和开箱即用的 Homebrew cask。如果 SSH2FA 帮你省掉了每天的 2FA 折腾，欢迎为这 99 美元出一份力。

source: SSH2FA is locked
zh_hans: SSH2FA 已锁定

source: SSH2FA is running from a read-only location (probably still inside the disk image). Drag it to your Applications folder first, then updates install with one click.
zh_hans: SSH2FA 正在只读位置运行（多半还在磁盘映像里）。请先把它拖到"应用程序"文件夹，之后更新就能一键完成。

source: SSH2FA manages this host's ssh config entry.
zh_hans: 此主机的 ssh 配置条目由 SSH2FA 管理。

source: SSH2FA on GitHub
zh_hans: GitHub 上的 SSH2FA

source: SSH2FA refers to each host by its ~/.ssh/config alias. Add your first one and enter its password + 2FA secret — that's it.
zh_hans: SSH2FA 通过 ~/.ssh/config 中的别名来识别每台主机。添加第一台并输入密码 + 2FA 密钥，就这么简单。

source: Your password and 2FA secret stay in the macOS Keychain, locked to SSH2FA. Its signed identity stays stable across updates, so macOS does not need to authorize it again.
zh_hans: 你的密码和 2FA 密钥保存在 macOS 钥匙串中，并仅供 SSH2FA 使用。它的签名身份在更新后保持稳定，因此 macOS 无需再次授权。

source: SSH2FA needs to move older saved credentials into its new stable Keychain vault. macOS may ask permission to read the old items one final time; choose Allow. After migration, future updates will not ask again.
zh_hans: SSH2FA 需要把旧版保存的凭据迁移到新的稳定钥匙串保险库。macOS 可能会最后一次请求读取旧条目；请选择“允许”。迁移完成后，后续更新不会再次询问。

source: Save
zh_hans: 保存

source: Save changes
zh_hans: 保存更改

source: Save connection
zh_hans: 保存连接设置

source: Save your changes first — the test uses the stored credentials.
zh_hans: 请先保存更改 —— 测试使用的是已存储的凭据。

source: Saved
zh_hans: 已保存

# Saved as SSH alias “%@” (used for ssh %@).
source: Saved as SSH alias “%1$@” (used for ssh %2$@).
zh_hans: 已保存为 SSH 别名“%@”（用于 ssh %@）。

source: Saved credentials re-authorized — macOS won't ask again for this version.
zh_hans: 已存凭据重新授权完成 —— 这个版本 macOS 不会再询问了。

source: Saving…
zh_hans: 正在保存…

source: Scan QR from clipboard
zh_hans: 从剪贴板扫描二维码

source: Search hosts & tunnels
zh_hans: 搜索主机与隧道

source: Select the job on %@
zh_hans: 选择 %@ 上的作业

source: Server address
zh_hans: 服务器地址

source: Server busy — using backup
zh_hans: 服务器繁忙 —— 正在使用备用链路

source: Server didn't respond — network is slow, or server is unreachable.
zh_hans: 服务器没有响应 —— 网络较慢，或服务器不可达。

source: Server is rate-limiting too many failed logins — sitting out for a few minutes.
zh_hans: 服务器因失败登录过多而限流 —— 先等几分钟。

source: Server not accepting connections — sshd is down or wrong port.
zh_hans: 服务器拒绝连接 —— sshd 未运行或端口不对。

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置 (⌘,)

source: Show
zh_hans: 显示

source: Show /tmp/ssh2fa_daemon.log in Finder
zh_hans: 在访达中显示 /tmp/ssh2fa_daemon.log

source: Show /tmp/ssh2fa_daemon.log in Finder (the dashboard's “Logs” button opens the live in-app viewer).
zh_hans: 在访达中显示 /tmp/ssh2fa_daemon.log（面板上的“日志”按钮会打开 App 内的实时查看器）。

source: Show 2FA code (reads this host's secret once)
zh_hans: 显示 2FA 验证码（读取一次此主机的密钥）

source: Show Dynamic Notch toasts
zh_hans: 显示灵动岛提示

source: Show SSH2FA logs…
zh_hans: 显示 SSH2FA 日志…

source: Show the password you typed
zh_hans: 显示你输入的密码

source: Show what you typed
zh_hans: 显示你输入的内容

source: Show ~/.ssh/config in Finder
zh_hans: 在访达中显示 ~/.ssh/config

source: Skip for now
zh_hans: 暂时跳过

source: Skip this version
zh_hans: 跳过此版本

source: Sleep & Wake
zh_hans: 睡眠与唤醒

source: Sponsor
zh_hans: 赞助

source: Sponsor on Ko-fi →
zh_hans: 在 Ko-fi 上赞助 →

source: Standing by
zh_hans: 待命中

source: Start
zh_hans: 启动

source: Start SSH2FA at login
zh_hans: 登录时启动 SSH2FA

source: Start automatically with SSH2FA
zh_hans: 随 SSH2FA 自动启动

source: SSH2FA isn't ready
zh_hans: SSH2FA 尚未就绪

source: Starts automatically with SSH2FA
zh_hans: 随 SSH2FA 自动启动

source: State
zh_hans: 状态

source: Step %lld of 2
zh_hans: 第 %lld 步，共 2 步

source: Still finishing the previous attempt — try again in a moment.
zh_hans: 上一次操作还没结束 —— 请稍后再试。

source: Stop
zh_hans: 停止

source: Stopped
zh_hans: 已停止
